---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
source: html/2c02f6e5-72a3-46e0-62ce-811b288255f7.htm
---
# StructuralSection Properties

Common set of parameters for structural analysis.